In [1]:
import pandas as pd
from functions import check_nan
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

In [2]:
actors = pd.read_csv("../data/cleaned/actors_clean.csv")
films = pd.read_csv("../data/cleaned/films_clean.csv")
old_HDD = pd.read_csv("../data/cleaned/old_HDD_clean.csv")

I need to create a database for the common table for actors and films on mySQL. For that, I will use the actors, films and old_HDD data. This is the only way I can join them since the actor and old_HDD share first_name and last_name and film and old_HDD share title. I need to create actors_films and it needs to include actor_id (in actor) and film_id (in film)

In [3]:
actors_subset = actors[['first_name', 'last_name','actor_id']]
films_subset = films[['title','film_id']]

actorss_filmss = old_HDD.merge(actors_subset, on=['first_name', 'last_name'], how='left')
actorss_filmss = actorss_filmss.merge(films_subset, on='title', how='left')

In [4]:
actorss_filmss.head()

  first_name last_name                  title  category_id  actor_id  film_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR            6         1        1
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS            2         1       23
2   PENELOPE   GUINESS            ANGELS LIFE           13         1       25
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS           10         1      106
4   PENELOPE   GUINESS          CHEAPER CLYDE           14         1      140

In [5]:
selected_columns=['actor_id','film_id']
actors_films=actorss_filmss[selected_columns]
actors_films.head()

   actor_id  film_id
0         1        1
1         1       23
2         1       25
3         1      106
4         1      140

I merged the three and selected only the columns that I was interested in.

In [6]:
actors_films.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   actor_id  1000 non-null   int64
 1   film_id   1000 non-null   int64
dtypes: int64(2)
memory usage: 23.4 KB

In [ ]:
for c in actors_films.select_dtypes(include="integer"):
    
    actors_films[c]=pd.to_numeric(actors_films[c], downcast="integer")

Downcasted integers

In [ ]:
actors_films.to_csv("../data/cleaned/actors_films_clean.csv", index=False)

Saved new file

In [ ]:
films.shape

In [ ]:
films_withcategory = pd.merge(films, old_HDD, on=['title'], how='left')
films_withcategory.tail()

I also have to put category_id on films. I will again use old_HDD for this

In [ ]:
films_withcategory=films_withcategory[["film_id", "title", "description", "rental_duration_days", "rental_rate", "length", "replacement_cost", "rating", "special_features", "category_id"]]

Selecting only the columns I am interested in.

In [ ]:
films_withcategory.duplicated().any()

In [ ]:
films_withcategory=films_withcategory.drop_duplicates()

In [ ]:
films_withcategory.shape

Dropped duplicates.

In [ ]:
films_withcategory.isnull().sum()

In [ ]:
films_withcategory.fillna(value="unknown", inplace=True)

There were only 614 rows in old_HDD but 1000 in film. When I merged them to add category_id in films, I created 386 null values. I filled those in with "unknown".

In [ ]:
films_withcategory.info()

In [ ]:
for c in films_withcategory.select_dtypes(include="integer"):
    
    films_withcategory[c]=pd.to_numeric(films_withcategory[c], downcast="integer")

In [ ]:
for c in films_withcategory.select_dtypes(include="float"):
    
    films_withcategory[c]=pd.to_numeric(films_withcategory[c], downcast="float")

In [ ]:
films_withcategory["rating"] = films_withcategory["rating"].astype("category")

In [ ]:
films_withcategory.info()

Downcasted integers and floats and changed rating type to category

In [ ]:
films_withcategory.to_csv("../data/cleaned/films_category_clean.csv", index=False)

Saved the file